["I'm more likely to run away from danger.", "Dan: Lady folk, in general.", "Vanessa: But I said something dinner...", "Dinner? Different.", "I said something different.", "Dan: Food is still on her mind.", "Vanessa: Oh, food.", "I said something different.", "I said, a horny toad, which is actually a type of lizard.", "A horny toad has something very interesting that they do.", "They, when faced with danger can stop their blood flow to their heart.", "Their blood fills up in them and they shoot blood out of their eyes at their aggressor.", "What?", "Dan: Into their aggressor's eyes?", "Vanessa: At least at their aggressor.", "And the blood isn't venomous or anything like this,", "it's just shocking.", "So, I thought it would be hilarious.", "Dan: That would shock me.", "Vanessa: If, Oh, hi, I'm Vanessa.", "Nice Vanessa.", "And then, somebody is a bad person and I just went bzz", "and shot blood out my eyes at them.", "Dan: Yeah.", "Vanessa: I think it would be so shocking that I could be saved.", "Dan: Sure.", "Vanessa: But, maybe flying is something I would realistically be more likely to do.", "Oh, I probably would fly away instead of fighting.", "But, shooting blood out of your eyes if you're in danger?", "Dan: It's not going to win you a lot of dates.", "Vanessa: No.", "Dan: Hey, baby.", "Vanessa: Look what I can do.", "Yeah, but isn't that crazy,", "that it's actually a lizard,", "but the horn toad can shoot blood out of its eyes?", "How in the world", "Dan: And how does that even help it?", "Vanessa: Did even nature decide to do this?", "Dan: I don't know.", "Vanessa: I mean, it must be in danger in some ways", "that it goes away,", "it makes stuff go away because of that.", "Anyway, crazy, so.", "Dan: The animal is just so disgusted,", "it doesn't want to eat it.", "Vanessa: I know.", "You got blood shooting out of your eyes.", "What?", "So, I want to know for you,", "if you could have any animal's defense mechanism,", "what would it be?", "There are many crazy things out there.", "There are ants that shoot acid,", "there are porcupines that have quills.", "This is a great way to expand your vocabulary in a fun way.", "If you would like,", "you can type into Google amazing animal defense mechanisms.", "And you'll see many lists of cool things that animals do", "if you like that stuff.", "So I want to know,", "let me know in the comments,", "what would you like to defend yourself with?", "All right, let's go to our next question.", "Dan: Caw.", "Vanessa: Question number seven is about holidays.", "The question is, what is your favorite holiday tradition?", "And I have a feeling that we might have the same one.", "Dan: We had to have.", "Vanessa: So do you want to say it at the same time?", "Dan: Yeah.", "Vanessa: On three?", "Dan: Yes.", "Vanessa: Okay. 3, 2, 1,", "Dan: Christmas tree.", "Vanessa: Decorating the Christmas tree.", "Dan: Yes.", "Decorating the Christmas tree.", "Vanessa: Yeah.", "Okay. Why don't you explain first?", "Why do you like decorating the Christmas tree?", "Dan: Man.", "There's probably a lot of reasons.", "One primary reason is that this is a tradition", "that our family always did.", "Vanessa: Mm hmm.", "Dan: So it has a lot of nostalgia tied up into it.", "And we don't have a lot of other traditions", "that our family always did.", "So there's Thanksgiving, which is,", "you have a meal and you talk about what you're thankful for.", "And that's another big one.", "But, maybe it's just because you put presents under a tree", "that, as a kid, you just can't get enough of Christmas.", "Vanessa: And now?", "Dan: Yes.", "And now, I really enjoy picking out a Christmas tree.", "We're really nature y.", "So, we get a real Christmas tree", "and I like the smell of the pine.", "It just hits all of the right senses and feelings.", "And then, you get to decorate it.", "So, your kids are excited,", "and you get to hang up all the stuff,", "and put up the lights,", "and there's a whole process.", "And, it's funny because it's probably the most useless thing", "that we do, but it's one of the best things.", "Vanessa: Yeah.", "I think, even before we had kids,", "this was a big deal for us.", "Dan: Of course.", "Vanessa: In our marriage,", "because yeah, it's something that you do with your parents growing up.", "And then, for us, when we got married", "and we started doing that with each other,", "it felt like, Oh, this is our new life.", "This is us.", "We're doing this together.", "And you're", "Dan: We're starting the new generation.", "Vanessa: Yeah, our new traditions.", "We're doing this in our own way.", "Yeah, it felt different.", "I said that for me,", "because when I was a kid,", "we didn't have a real Christmas tree,", "we had a fake tree.", "But even in that,", "I was so excited about it.", "First of all, I'll set the stage,", "my mom popped popcorn.", "So, we ate popcorn and it smelled great.", "We listened to Christmas music.", "Dan: Always good.", "Vanessa: And then, we all sat in the living room,", "and because we had a fake tree,", "there's different fake trees,", "but the kind we had,", "there was a stem in the middle and it had different holes", "and you could hook the branches in", "and the branches had different colored rings on them,", "so you could see the big ones are on the bottom.", "But, because these were closed in a box the entire year,", "they were flat.", "So, we would all sit around the Christmas tree,", "bending the branches to look realistic.", "So, we would bend each of the little branches on it", "and then put it in.", "And we'd look at each other's and say,", "Oh, that one doesn't look good.", "Or, Oh,"]