["within the last two years, the most passionate, can you guess?", "Dan: Something about Native Americans?", "Vanessa: No, I do read a lot about native Americans though.", "Is a book called Digital Minimalism.", "Dan: Oh yeah.", "I thought you were talking fiction.", "Vanessa: Yes.", "Which is", "Dan: Or nonfiction.", "Vanessa: Oh, this one is not fiction.", "Dan: This is nonfiction.", "Vanessa: It's ironic because we are here sharing this on social media.", "Dan: Yeah.", "Vanessa: But if you feel like you look at your phone too much,", "or if you feel like, Why did it seem like life was so much more simple in the 1990s?", "Dan: It was.", "Vanessa: This is a wonderful book to read, Digital Minimalism.", "It confirmed everything that I suspected or that I thought about,", "especially about phones, but about media in general.", "Dan: Technology.", "Vanessa: But it gave a better plan for what to do", "because you can't just cut out YouTube from your life.", "I need", "Dan: I don't know about that.", "Vanessa: You can't cut out Vanessa's videos.", "When I need to, for example, do something with the garden,", "what do I do when I don't know?", "I Google it.", "I watch a YouTube video.", "It's very useful in many ways,", "say for education or even for entertainment,", "but this book helps you to have a good plan", "so that you are the one in control of your media use.", "It's not just social media.", "It could be watching the news all the time.", "It could be listening to podcasts all the time,", "whatever it is.", "I feel like this book helped me to create a better plan for myself", "so that I felt more in control.", "So I highly recommend this book", "because I feel like it's ubiquitous that everyone,", "especially if you're watching this on YouTube in some way", "Dan: Struggles.", "Vanessa: uses technology more than they would like.", "Dan: Yeah.", "Vanessa: And technology's not a bad thing.", "Dan: It's a modern problem.", "Vanessa: Yeah.", "It's just something that can easily get out of hand,", "which is a great expression.", "Dan: So do you have any fiction books though?", "Vanessa: Oh yes.", "But that is", "Dan: Recommendations?", "Vanessa: a whole nother rabbit hole.", "Dan: Yeah.", "Vanessa: I would recommend if you want to read", "Dan: We didn't mention fiction.", "Vanessa: Yeah.", "Dan: You got to say one thing at least.", "Vanessa: Well, I do recommend watching my videos about fiction book recommendations.", "Dan: She's got a whole video about it right here.", "Vanessa: I have four videos.", "Dan: Or is it here?", "Vanessa: Three videos I think so far about book recommendations.", "If you would like to watch my video about books to learn about America.", "So they're American books about American culture", "or they're books that are popular about the US.", "There's books I mentioned about beginner English books.", "If you've never read a book in English before", "I made a video about those.", "Nonfiction books, I think I did an advanced book video as well.", "There are a lot.", "So I will put those links in the description.", "Please dive into that if you're interested in reading.", "It's something I'm passionate about,", "so I'm always happy to share more about it.", "And I'm glad this last question was something that is so exciting for me.", "Yes.", "Well, thank you so much everyone for joining us today", "for this very, very long conversation.", "Dan: Yes.", "We hope you enjoyed it.", "Vanessa: Yes.", "I hope that you enjoyed it.", "I hope that you can dive into it a little bit deeper", "if you would like to download the free MP3.", "I mean not MP3, PDF.", "It's been a long morning making this video.", "If you would like to download the free PDF worksheet for this video,", "there is a link in the description.", "You’ll get access to all of the questions,", "some of the key sentences that we said,", "and if all goes well, next week I will be making a video", "specifically focusing on some key vocabulary from this video.", "We'll expand.", "I'll be explaining", "Dan: Dive into our ramblings.", "Vanessa: Yes.", "Explaining some of the key expressions that we talked about in this video.", "Not all of them, but the ones that I deem the most important.", "So stay tuned next week.", "You can download the PDF today and then join me next week", "to dive into the vocabulary a little deeper.", "Well, thanks Dan.", "Dan: You're welcome.", "Vanessa: This has been a journey this morning.", "Dan: Many questions.", "Vanessa: Many questions.", "Dan: Many answers.", "Did we solve the meaning of life?", "Vanessa: Oh, that's a good question.", "Let us know.", "Do you think we solved the meaning of life?", "What is the meaning of life?", "Dan: I think we did as best we could.", "Vanessa: If you made it to the end of this video,", "I would like to give you a little", "Dan: High five.", "Vanessa: A high five, and also a little surprise.", "Dan: Oh.", "Vanessa: If you made it to the end of this video in the comments,", "I want you to write blue water bottle.", "And when I see that in the comments,", "I'll know you finished this video because you wrote blue water bottle.", "Dan: You saw the blue water bottle.", "Vanessa: Oh, it's here.", "Okay.", "Well that's our little secret nugget at the end of this video.", "Thank you so much for joining us.", "And I will see you again next Friday for a new lesson here on my YouTube channel.", "Bye.", "Dan: Bye.", "Vanessa: The next step is to download the free PDF worksheet for this lesson.", "With this free PDF, you will master today's lesson", "and never forget what you have learned.", "You can be a confident English speaker.", "Don't forget to subscribe to my YouTube channel", "for a free English lesson every Friday.", "Bye!"]