["I didn't grab it the right way.", "I was like swinging it through the air.", "That was probably the dumbest thing I ever did honestly", "catching critters as a child.", "It extends beyond that too.", "I've always liked keeping fish.", "I love making fish tanks and the environments.", "Obviously you can do that for frogs and reptiles.", "I have big dreams for my son", "because he's also very into this.", "Vanessa: Oh yeah.", "He is crazed about his net and catching stuff.", "He just loves that.", "I mean it's treasures in nature.", "Dan: Soon enough, our house will turn into a menagerie of critters.", "Vanessa: I just have one rule.", "I would Dan: Scorpions.", "Vanessa: I don't mind keeping frogs and lizards and fish.", "Dan: Snakes?", "Vanessa: But I don't want to keep any snakes.", "Dan: Oh, come on.", "Vanessa: I know a lot of snakes are harmless", "Dan: They're cute.", "Vanessa: but I would rather the snakes live under our shed", "than live in our house.", "Dan: That's more dangerous.", "Vanessa: Well, if they're not poisonous.", "If they're not venomous, then they can catch rats", "and catch things and keep our chicken safe, that type of thing.", "Dan: That's what snakes do?", "Vanessa: Yeah.", "A lot of chickens", "Dan: They protect chickens.", "Vanessa: Yeah.", "A lot of people, and this is getting a little deep", "Dan: Are chickens critters?", "Vanessa: I don't think so.", "When I think of a critter,", "I think of crawling, like something that goes like k k k k,", "like a little crawly thing.", "Dan: Am I a critter?", "Vanessa: That's a good question.", "I was going to say some people,", "we have chickens, you might have seen this on our YouTube channel before,", "some people purposefully have a rat snake or a black snake,", "a garter snake that lives in their chicken coop,", "and they eat like one egg per two weeks or something.", "They don't eat that much.", "Dan: Is that good?", "Vanessa: They do it for protection.", "They're keeping rats away.", "They're keeping other things away from the coop.", "There's a whole, let me tell you", "Dan: You want me to bring snakes into our family,", "well, but outside?", "Vanessa: As long as they are outside, that's okay.", "I don't want snakes in my house.", "Dan: I have lots of good stories about snakes in the house.", "One snake escaped in the house.", "Vanessa: Oh, don't tell me that.", "Dan: My mom found it under the couch months later and it was dead.", "Vanessa: Oh no. Yeah.", "Dan: It was one of those classic situations of mom screams in the other room,", "and we're like what? What?", "Vanessa: You kids have that snake in here?", "Dan: Daniel, gee, what is this thing? That's what she'd say.", "Vanessa: Well, do you want to share also while we're on this topic,", "your first memory, the frog?", "Dan: Oh my very first memory.", "Vanessa: Yes.", "This will drill in the point that Dan loves critters.", "Dan: Yeah.", "I caught a toad probably when I was two years old", "and I was, for some reason, holding it off my deck", "and I dropped it down into the bushes.", "I remember thinking, no, my toad.", "Then I went down to look for it and I couldn't find it.", "Vanessa: This is Dan's first memory in life.", "Dan: Yeah, literally one, at least as far as I know.", "Vanessa: Well, there you go.", "Dan: Yeah.", "That's the point of it?", "Vanessa: A lifetime of catching critters started at a young age.", "Well, I think", "Dan: Yeah.", "How about you?", "Vanessa: For me?", "Dan: What do you still do besides catching lots of critters?", "Vanessa: I do catch tadpoles still.", "That's fun.", "I think the thing that first came to my mind,", "and I tried to think about just like the first thing", "that came to my mind for each of these,", "is when I was a kid I loved to dig in the dirt.", "My sister and I had two best friends who lived right across the street,", "and we spent hours in the backyard just digging in the dirt.", "We built things in the dirt.", "We had little inventions.", "We made homes in the dirt.", "We did so many things.", "Now I dig in the dirt, but I call it gardening.", "Dan: I think we have the wrong YouTube channel.", "We just need to be covered in mud with like snakes and gardening.", "Vanessa: Maybe that will be YouTube channel", "Dan: Number two.", "Vanessa: Number two,", "Dan catches critters and Vanessa digs in the dirt and gardens.", "I remember when I was in seventh grade at school,", "we had a class, I think it was Home Ec.,", "which is like home economics.", "You learn about cooking, and sewing,", "and those types of things.", "There was a hygiene section where you learned how to take care of your hair,", "how to take care of your nails.", "I remember specifically", "Dan: How to take care of your nails?", "Vanessa: I know.", "Dan: There's a class about that?", "Vanessa: Well, it was like how to,", "I don't know, some people maybe don't learn that at home,", "like how to trim your nails and stuff.", "This lady was one of those people that as a middle schooler,", "most middle schoolers just roll their eyes at,", "like, oh, you think I'm going to do that?", "Oh, I'm not going to be like you,", "but she was our teacher.", "She was telling us how to clean our nails and paint them in this type of thing.", "I remember asking", "Dan: Was it for ladies only?", "Vanessa: Yeah, we were split by gender,", "so there was boys in one class,", "girls in the other just for Home."]