["that was so fun and so smart.", "Dan: You could see the intelligence in that dog's eyes.", "Vanessa: Oh yeah.", "That dog was amazing.", "But that dog was living in the perfect place.", "It had endless stimulation, endless exercise.", "Dan: Never went inside.", "Vanessa: That dog could work there.", "Yeah.", "It was great.", "But I think it's also smart to know what animals don't fit your life.", "And for us, at least at the moment,", "we have a lot of smart, fast running around creatures in our house called children.", "So we're at our capacity.", "Dan: Yes.", "Yeah.", "And there's also more dogs that I actually dislike than like.", "There's a lot of dogs I'm just like, No, thank you.", "Small yippy dogs, no.", "No, thanks.", "No.", "Vanessa: It's not your style.", "Dan: Not my thing.", "Vanessa: Yeah.", "Dan: It'd need to be bigger, smarter, noble, cunning.", "These are the words that come to my mind when I think of a cool dog.", "Vanessa: Okay, yeah.", "A dog that helps you in some way too.", "A working dog, maybe.", "Dan: Sure.", "That's not even necessary.", "Just one that can catch a Frisbee.", "Vanessa: Oh, that sounds fun.", "Cool.", "Well, our kids are getting there.", "Did you have another one?", "I thought you said you had a second one.", "Dan: Oh, well, so I also said some fish.", "Vanessa: Oh.", "Dan: Like a giant fish.", "Vanessa: What's giant mean?", "Dan: This is", "Vanessa: Like a whale?", "Dan: Both of these are unrealistic.", "Because you said any pet.", "Vanessa: Yeah.", "It's okay.", "We can dream.", "Dan: When you get into the aquarium world.", "Let me tell you about the aquarium world.", "You can get pretty detailed and intense about it.", "And there are some really cool fish.", "There's one, I think it's called a arowana.", "Vanessa: Okay.", "Dan: I want to say, and they can get like this big.", "Vanessa: What kind of tank do you have to have?", "Dan: They're shiny and they can be gold or red,", "but they'll literally sell for 10,000.", "Vanessa: What?", "And you probably have to have a tank the size of this room.", "Dan: And you need a big tank.", "Probably not the size of the room.", "Vanessa: Oh my goodness.", "Dan: I wouldn't want to spend money on it.", "I'd never bring myself to spend money on it.", "Vanessa: You can't justify spending money on it.", "Dan: If somebody just gave me the supplies and the fish,", "I'd set it up and be happy.", "Vanessa: Okay.", "That's a good dream.", "Yeah.", "Like my dream.", "Dan: Yeah.", "How about you?", "Vanessa: I said", "Dan: A dinosaur.", "Vanessa: No, I said a cow.", "Dan: Oh.", "Vanessa: Yeah.", "I think it would be cool to have a cow, but", "Dan: Daisy.", "Vanessa: The only way I would have a cow is if basically", "I was just the owner and someone else came every day to milk the cow.", "Somebody prepared, took care of the cow.", "I don't want to take care of it.", "Dan: And in this scenario you're a noble woman.", "Vanessa: Yes.", "Dan: Living in her manor.", "Vanessa: Yes.", "And I would say, Go take care of my cow down there.", "Basically.", "I just want lots of milk.", "Lots of milk", "Dan: Free milk.", "Vanessa: to make", "It's not free.", "There's a lot of work into a cow.", "Dan: Okay.", "Not so free.", "Vanessa: I have to pay the person who takes care of the cow.", "Dan: You're not touching udders.", "Vanessa: Having endless amounts of yogurt, cheese, milk,", "that's from your fresh dairy cow.", "That's cool.", "But it's also extremely hard.", "Dan: They poop all over your yard.", "Vanessa: Well, I don't even need to keep it in my yard.", "Dan: So do the chickens.", "Oh.", "Vanessa: It would be on my farm.", "Dan: Oh.", "Vanessa: It would be in someone else's farm and I would just own that cow.", "Dan: On your manor.", "Vanessa: But there's actually, I was thinking about this the other day,", "we stayed at an Airbnb that was a farm and they have some cows and horses and chickens", "and they have a milk sharing program where you can buy part of the cow.", "So you're not actually like I buy the leg of the cow, that kind of thing.", "They're saying, if you buy part of the cow,", "the ownership of this cow,", "you will get a certain amount of milk per month from that cow.", "So it's what I'm thinking.", "You don't have to do any work, but you get the milk.", "Yeah.", "And you pay for it.", "But it's local and it's going back to justifying,", "spending more money on high quality animal products.", "Dan: We could just do that.", "Vanessa: We eat a lot of yogurt and I hate to buy all the yogurt.", "We buy a bulk big yogurt container,", "but we go through so many of those.", "We eat yogurt a lot.", "Our kids eat yogurt a lot.", "Dan: Our kids love yogurt.", "Vanessa: Yeah.", "I think that if we had something like a milk sharing program,", "we would, or I would be more inclined to just make some yogurt in the Crockpot or something", "and have that at home.", "Anyway.", "Dan: That's a very Vanessa answer.", "Vanessa: That's a dream.", "Dan: A cow that you don't want to take care of.", "Vanessa: No, I don't want to take care of it.", "Dan: Those people that had the cow at the Airbnb,", "they looked really tired.", "Vanessa: They said", "Dan: They had three cows, two cows?", "Vanessa: They said the word we would use to describe having a cow is relentless.", "They said rain or shine,"]