["Ec.", "I remember her saying how to clean your nails", "and make them look nice.", "I remember asking in the class,", "I said, but what if I always have dirt", "under my nails?", "Dan: You raised your hands and asked that?", "Vanessa: I asked that question.", "I was so naive.", "I always have dirt under my nails.", "I can't get them clean like that.", "She looked at me like, what?", "Like I had three heads on my head.", "What? Why would you have dirt under your nails?", "You're a seventh grade girl.", "I think after that", "Dan: Be proper.", "Vanessa: maybe when I was in eighth grade or so", "I had a phase where I stopped playing in the dirt", "and did other things.", "Now I have come full circle and well,", "I took a shower recently,", "so my nails are actually clean,", "but they're almost always full of dirt.", "Just like our kids.", "Dan: I'm sure you put in more effort", "to get the dirt out now.", "Vanessa: Yeah. Kind of.", "Sometimes it works, sometimes it doesn't,", "but I have the same mindset", "as a seventh grader of, well,", "my hands aren't going to be completely clean because", "Dan: You really do.", "Vanessa: I was just playing in the dirt.", "What's the matter with that?", "Dan: If you look at Vanessa's wardrobe,", "I have more clothes than her half the time.", "Vanessa: I don't really care about those kind of things.", "Dan: Yeah. She's not your typical girly girl.", "Let's put it that way.", "A girly girl.", "Vanessa: That's okay.", "Dan: That's my sister.", "Maybe we'll talk about her later.", "Vanessa: Okay. All right.", "Well, let's go to our next question.", "But before we do that,", "I want to ask you,", "what is something that you did in childhood", "that you still do now?", "Let us know in the comments.", "All right. Let's go to question number three.", "Question number three is about hobbies.", "I'd like to know if you could wake up tomorrow", "and magically have any kind of education,", "talent, or skill set, what would it be?", "Dan: Education or skill?", "Vanessa: Yeah, this is very broad.", "Dan: Yes. Well, when I think skill,", "I mean, I think that I would want to be,", "and this is a little stereotypical,", "an athlete of some kind,", "particularly a hockey player.", "When you are playing a sport", "and you really like that sport,", "you get into the flow and you just live in that moment", "and you just have so much fun.", "I can remember as a kid,", "one time I scored a goal to win the game in hockey,", "and that's just the greatest feeling ever.", "Now, if you add to that,", "a big stadium full of fans cheering your name", "Am I egotistical? I don't know.", "That would just be the ultimate thrill", "to score a goal and hear everybody cheering.", "I would say, yeah,", "either an athlete of some kind or a performer.", "I think you get the same kind of feeling", "if you are acting,", "if you're maybe a standup comedian", "and you're making people laugh.", "Dan: Even to a certain degree,", "I think being a really great teacher,", "being a really great teacher", "probably gives you that same kind of feeling", "of you're performing and bringing value", "and people are entertained.", "If I were to have like,", "I wasn't thinking so much education,", "I was thinking more skills,", "so I would wake up tomorrow", "and I'd be the best hockey player on earth.", "Vanessa: Wow.", "Dan: Maybe that'd be a little bit boring", "just beating everybody right and left.", "I'm sure you still have to work though.", "Yeah, I'd have great athletic prowess.", "Vanessa: Cool.", "Dan: How about you?", "What would you want to wake up tomorrow with?", "Vanessa: Well, I said something a little bit stereotypical too.", "I had my primary answer and then a maybe cheat answer.", "I think if I could wake up tomorrow with a skill,", "maybe I said something a little more realistic.", "I said, I'd like to be able to play the ukulele really well.", "Dan: The ukulele?", "Vanessa: I don't play the ukulele.", "I play the flute.", "I don't know.", "I just thought if I could have a cool skill,", "I mean, that's something that I could take outside.", "I could be playing while the kids are playing.", "Dan: This is a very humble dream.", "Vanessa: Maybe it is.", "I didn't want to think for too long about this.", "I wanted to give you my initial response.", "Yeah, I think it would be cool.", "A guitar is pretty big to take somewhere.", "A piano would be amazing,", "but it's not quite as portable.", "I just feel like sometimes when you're,", "I had this image,", "like you're sitting around a bonfire", "and the sun setting", "and you're just chatting with your friends,", "just having a ukulele and playing some music,", "oh, that just brings the atmosphere", "to a very warm place.", "Dan: You could play Wheels On the Bus for our children.", "Vanessa: I could maybe play Wheels On the Bus in five minutes.", "Dan: That's the first song that comes to my head.", "The version we listen to,", "It's like do, do, do, do,", "and I just hear ukulele.", "Vanessa: Yeah.", "Well, if you play the ukulele", "and you have any recommendations,", "let me know in the comments,", "but my cheat answer,", "because I wasn't sure if it was a skillset", "or a character trait,", "but I said unlimited patience.", "If I could wake up in the morning", "Dan: That's an education.", "Vanessa: and oh, I guess you can learn patience.", "If I could have unlimited patience with my children,"]