["And, after that year, that restaurant closed.", "No.", "Dan: No.", "Vanessa: So, when this question says, something you wish you could try again,", "this will always be just a wish.", "Dan: I'm sure that lady opened up another restaurant, right?", "Vanessa: I hope so.", "I hope she is world renowned as an amazing dak galbi restaurant,", "because we had dak galbi also in Suan,", "and that was nice.", "That lady was super nice.", "We talked through Google translate a lot.", "Dan: Yeah.", "Their dak galbi was good too.", "Vanessa: Yeah, but there's something about that first place that really", "Dan: It had the nostalgia.", "Vanessa: It has a special place in my heart.", "So, that's what I would say.", "Dan: It is funny though, we would take Korean people there", "and they'd be like, Yeah, it's pretty good.", "Vanessa: But for us, that was", "Dan: We're like, This is so awesome.", "Vanessa: So fun.", "Yeah.", "Anyway, you can see, we get very excited about food.", "Now, maybe I know why our children are also excited about food.", "They're crazed about food, so.", "Dan: It's because they're kids.", "Vanessa: Yeah.", "But some kids are very picky.", "Dan: Well, that's true.", "Yeah, they do like more food than average kids.", "Vanessa: Our kids love all this type of stuff just as passionately as us.", "All right.", "So I have a question for you.", "What is a food from your travels that you wish you could have again?", "It might be because it was good.", "It might be because of the vibe, and the atmosphere,", "and the memories, the nostalgia, like what we talked about.", "Let us know in the comments what food you wish you could have again,", "and we'll learn about food from around the world.", "All right, let's go to the next question,", "question number six.", "I think we're on six.", "Dan: Yeah.", "Vanessa: All right, question number six.", "Question number six is about nature.", "This is maybe a little silly of a question, but that's okay.", "Dan: We like critters, so that's okay.", "Vanessa: Yeah, as you can tell.", "So, this question is, if you could have any defense mechanism of an animal,", "what would you have?", "So if you could have that type of defense mechanism in your body or become you", "Dan: In my body.", "Vanessa: Yes.", "What would it be?", "So can we maybe explain quickly what a defense mechanism is?", "Dan: Yeah, sure.", "So, a defense mechanism is something that an animal has or uses,", "a feature that protects it from predators.", "Vanessa: Yeah.", "Dan: Or is a way to either get the predator to go away", "or escape the predator.", "Vanessa: So maybe quills on a porcupine, something like this.", "And we can even say humans have a defense mechanism.", "We might use that emotionally.", "Dan: Oh yeah.", "Vanessa: To say, Oh, why is he always making jokes?", "It's actually a defense mechanism because he experienced a lot of trauma in his life,", "and joking, and laughing helps him to not feel so vulnerable.", "Dan: Yeah.", "Vanessa: Or something like this.", "It's more of an emotional thing.", "So you can have a defense mechanism as a human,", "but I want to know, in a silly way,", "if you could imagine having an animal's defense mechanism, what would it be?", "Dan: Mine would be... This is a little bit of a cop out.", "Vanessa: Okay.", "Dan: Flying.", "Vanessa: Oh.", "Dan: Because now we don't really associate flying with just defense,", "but it can certainly be used as a defense,", "so a bird will fly away when you come near it.", "And we were talking about it earlier and saying that flying probably evolved", "as a defense mechanism for an animal to get out of the way from a predator", "really efficiently and effectively.", "Vanessa: Yeah, I almost said flying too for this one.", "Dan: Yeah.", "Vanessa: It's a good one.", "Dan: So, I mean, but who doesn't want to fly?", "Vanessa: Yeah.", "Dan: I mean, of course then you have to be really lightweight", "and you're probably not very intimidating.", "And then, you have to be a bat or a bird.", "Vanessa: You could be an Eagle.", "Dan: But, if I could still be me and fly, then I would choose that.", "Vanessa: Yeah, just imagine, you're walking down a dark alley,", "I don't know why you're walking down a dark alley,", "and then somebody dangerous steps out", "and all of a sudden your wings open up and you fly away.", "Dan: Ooh, they pop out of my back like an angel.", "Vanessa: That's it.", "Yeah, that's it.", "I think there's some X Men or superhero or something that does that.", "Dan: Oh, yeah, probably.", "We don't know about that stuff.", "Dan: Bird man.", "Vanessa: Bird man.", "Is that a", "Dan: Or Batman, squawk man.", "Vanessa: Eagle man.", "Dan: Okay.", "Dan: Raven man.", "Robin man.", "Robin.", "Vanessa: California condo man.", "Dan: Blue bird man.", "Vanessa: These are all the birds we know.", "Okay, well", "Dan: And we're not into superheroes, so.", "Vanessa: Flying is a good one.", "I almost said that.", "And you know what?", "I think, I have something different I'd like to share.", "But, I think for me actually flying is probably more realistic.", "Not like I can actually fly,", "but because if I'm faced with danger,", "I'm probably more likely to flee.", "Dan: Oh, yeah.", "Vanessa: Than to fight.", "So, we call this fight or flight.", "When you're in a dangerous situation,", "either dangerous physically or dangerous emotionally,", "we say, Oh, your fight or flight kicks in.", "So, either you fight and you try to win or you flee.", "So, that's", "Dan: Run away.", "Vanessa: The flight part.", "You're not actually flying,", "but maybe you try to run away from that dangerous situation.", "And I think for me, that's more true."]