["and not because I'm afraid of heights", "actually, he's more scared of heights than I am.", "I think it's funny that he likes doing this so much.", "He says every single time he does it, he's scared.", "Vanessa: Oh.", "Dan: Yeah.", "Vanessa: Interesting.", "Dan: But I'm not afraid of heights,", "so I wasn't really worried about that.", "I probably should have been more worried about it.", "Vanessa: What were you worried about?", "Dan: I'm a perfectionist, or a completionist.", "So, it really bothers me if I try something", "and I can't finish it.", "Vanessa: Ah, so you wanted to be able to make it to the top.", "Dan: So, I knew I could probably do some easy stuff,", "but he's a lot better than I am.", "So, I knew that he would be wanting to move on", "to something more challenging.", "And, I didn't really know if I wanted to have to just watch,", "or try it and only get partway.", "In the end, I did do that.", "So, the first one was an easy one.", "I don't think it was Vanessa:", "I'll show you a picture here of Dan making it all the way to the top.", "Yes.", "Dan: Yes.", "So, I do naturally have a good body type for climbing.", "I'm lightweight.", "I climb a lot of trees.", "I like to hike and do all that stuff.", "So, I can figure it out.", "But, the hand strength is just on another level to rock climb.", "Vanessa: Yeah.", "Dan: And so, I did the easier one and I made it to the top.", "But, all the other ones, I made it partway.", "And, I actually remember, we were with another guy too,", "his name was Jim.", "And, Jim was really inspiring, because...", "And don't worry, this was totally safe.", "There was a rope tied to the very top.", "They call it top climbing? Top rope?", "I don't remember the terms.", "There's a lot of terms in rock climbing.", "Vanessa: Yeah.", "Dan: And so, he was tied to the top", "and if you fall that will catch you right away", "and it's not a big deal.", "Vanessa: Yeah.", "Dan: But, for me, if I fall one time doing that,", "I'm like, All right, I'm done.", "That's how I feel.", "But he fell probably 15 times on a climb", "and just kept on trying, and trying, and trying,", "and he made it to the top and I was like, Wow.", "And, when he got down, I said,", "I have to try a lot more than I would,", "because I just saw him persevere.", "So, it's a very good perseverance sport.", "Vanessa: Yeah.", "Dan: So, I tried, and tried, and tried,", "and I got one third of the way,", "because it was really difficult.", "It's called crack climbing.", "And there's just a crack in the wall.", "And, you got to put your hands there.", "And, just Vanessa: That's so hard.", "Dan: There's nothing except for a crack and little tiny ledges.", "So, their experienced, so they got up the first part really easily.", "So, the girl who was with us, she said,", "Yeah, that was tricky.", "But, I was stuck on the first part for...", "It felt like 20 minutes,", "it was probably more like 10 minutes.", "They just got up that part.", "But it was literally just a little thin rock", "you had to put your fingers in,", "barely any foothold.", "But, I saw Jim fall, and fall, and fall,", "and I kept on trying and I finally did it.", "Yes.", "Vanessa: Wow.", "Man, that is not up my alley at all.", "Dan: Yeah.", "Brad asked me...", "Brad's my brother-in-law.", "He said, Do you think Vanessa would ever do this with you?", "And I was like Dan: Brad's my brother-in-law.", "He said, Do you think Vanessa would ever do this with you?", "And I was like, I don't think...", "I can't imagine you wanting to do that.", "Vanessa: Yeah.", "I don't like heights like that,", "and I feel like I can't just do something like that like you.", "I would need to go to the climbing gym", "and feel comfortable with it,", "because at least for me,", "that takes a lot of upper body strength,", "your abs, your arms, your fingers.", "I think maybe for you,", "you were able to make it to the top of the easier one", "and halfway up or a third of the way up the other ones", "because you're not afraid of heights", "and your strength is distributed differently than mine.", "Dan: Yes.", "Vanessa: But I think for something like that,", "I would need to massively feel more comfortable with heights", "and go to the gym in advance.", "Dan: The girl who was with us was the best one there.", "Vanessa: Yeah.", "Dan: She was amazing.", "Vanessa: I bet.", "Dan: Yeah.", "Vanessa: I mean, you can practice that and do it.", "Dan: Women can definitely do it.", "Vanessa: Yeah.", "That's the cool thing.", "Dan: She was kind of like spider monkey, though.", "Vanessa: Going everywhere.", "Dan: She hadn't had any children yet.", "Vanessa: Yeah, maybe.", "Dan: Children does a number on you.", "I speak from experience.", "Vanessa: Yeah?", "In any case, I think that seems like the kind of exercise", "or sport that I would need to practice in advance", "before going outside to do it,", "and inside where there's, I don't know,", "maybe more predictability", "Dan: Mats.", "Vanessa: or practice, that would be better for me.", "Dan: I thought it was more fun outside.", "Vanessa: Yeah.", "Dan: Because I've done climbing gyms before,", "and it's okay,", "but outside's a whole adventure.", "It did take forever though.", "Vanessa: Yeah.", "You have to hook up everything.", "Dan: We did four climbs and we were there all day.", "You're watching other people go,", "and also one person has to be the...", "I forget what it's called.", "Vanessa: Belay.", "Dan: Belay.", "Yeah.", "One person's holding you,", "making sure you're not going to fall down,", "so they actually hold you up from the other end."]