["Vanessa: Hi, I'm Vanessa from SpeakEnglishWithVanessa.com.", "Today, I have a special guest, my husband, Dan.", "Dan: Hello.", "Vanessa: Today, we are going to be having a long English conversation,", "because over two years ago, back in February 2020,", "we made this conversation and millions of you loved this", "and said that it helped you to immerse yourself in English", "and have a fun time.", "Today, we are going to be doing something similar.", "We'll be talking about at least 10, possibly more, topics.", "We'll be giving our opinions and stories and ideas.", "Dan: Answers.", "Vanessa: Yes, whatever comes up along the way.", "There will be subtitles for key phrases down here,", "but you can also click CC to get the full subtitles", "so that you don't miss any words.", "All right, are you ready to get started?", "Dan: I'm ready.", "Vanessa: Let's do it.", "But wait, before we get started, like always,", "I have created a free PDF worksheet for this lesson", "that you can download.", "Never forget what you are about to learn.", "You can click on the link in the description", "to download this free PDF worksheet today,", "and you will have a chance to answer all of today's questions too.", "Dan: Oo.", "Vanessa: Okay.", "Are you ready for question number one?", "Dan: Yes, I'm ready. What is it?", "Vanessa: All right. Question number one.", "Dan: What is the meaning of life?", "Vanessa: Oh, that would be a good start.", "Topic number one is family.", "I'm going to be putting the timestamps for all of these topics", "in the description, so if you want to rewatch any of these sections", "you can easily skip to them.", "My first question is about family,", "and that is what is an interesting fact about your family history?", "Dan: Interesting fact.", "Well, I don't know too much about my mom's side of the family.", "I know they've been in the United States for a long time,", "but they just didn't really keep any records.", "On my dad's side, on the other hand,", "I have a, well, I had a particularly detail oriented grandmother", "who would remember everything about her childhood.", "She went back and looked at,", "I don't even know how she found documents about where they came from.", "Her family was in Germany, near,", "I can't remember, I think it's Hamburg, Hamburg.", "Grandpa was also from somewhere in Germany,", "and both of them just happened to move to eastern Kansas,", "which is if you've ever been to Kansas,", "it's just corn fields and that's it.", "It's not a very beautiful place,", "but somehow they ended up in Kansas.", "Dan: My grandma would always give lots of details", "about growing up there on the farm", "and how they didn't have electricity.", "She would go on about these stories about,", "this is how she would talk,", "one time, me and my brother Bern,", "we went to the backyard and filled up the tin bucket", "with hot boiling water,", "and he took all the hot water, Daniel.", "Vanessa: She remembered it was a tin bucket.", "Dan: Yeah, and it was cousin Bern,", "and it was Uncle Freddie, people like that.", "I think her father's name was Freddie.", "Vanessa: Oh, that's her son's name.", "Dan: Yeah.", "I don't know how interesting that is,", "but it's the only cultural knowledge I have about my past.", "The other side of the family, they just,", "we lived in Virginia a long time ago,", "and my great grandfather was a coal miner apparently", "so kind of interesting, I guess.", "Vanessa: Yeah.", "I think that's pretty cool though that", "because in the US everyone has heritage from other places", "around the world and it gets lost sometimes.", "In fact, that's what I was going to talk about too in a moment.", "That area in Kansas, I remember your grandma saying", "that there were German only churches.", "Dan: Oh yeah.", "Vanessa: So they would speak only German.", "Did your grandma know any German?", "Dan: Very little.", "I don't think she knew a lot.", "Vanessa: I think that's kind of the generational thing,", "like her parents knew it.", "Dan: She's probably the last generation that spoke German,", "or her parents were the last generation that spoke German.", "Vanessa: Yeah, but then for her she just understood probably some German.", "That community was, for some reason,", "where lots of German people moved to", "and that's where your family's from.", "Dan: Yeah.", "They went through a lot of really challenging cultural changes.", "There was a lot of German mistrust and hate during that time,", "obviously, for reasons that we can understand.", "Vanessa: Political reasons.", "Dan: We were at war with Germany a lot,", "so I think they were trying to scrub out a lot of the super German sounding things.", "Apparently our last name was more German sounding at one point.", "I don't know how they said it,", "and speaking German would certainly be one of those things.", "Vanessa: Yeah, so they tried to assimilate to life", "and that's similar to my", "Dan: Tell me about your family history.", "Vanessa: similar to the interesting point I wanted to tell you about.", "My family history is that on my dad's side,", "my great grandma and my great grandpa,", "they are from around the area of Naples, Italy.", "First, my great grandpa went on a boat,", "came to the US, married someone, had three kids.", "Dan: It was a good story.", "Vanessa: Then his wife died.", "Dan: Oh, that's the bad part.", "Vanessa: He had three kids and no wife", "and he's working, I'm sure, a really difficult job.", "That was not a time when you could be a single father.", "Dan: This was in Pittsburgh, right?", "Vanessa: They were either in New York or Pittsburgh,", "but by the time my great grandma came,", "they went to Pittsburgh.", "We're getting a little ahead of ourselves.", "He wrote a letter to his mother who"]