["Dan:When I first was thinking about this,", "I thought gadgets, like a new toaster", "that never burnt the toast.", "Vanessa:Okay.", "Dan:But I think when I think of noble uses", "for electronics, I think of the medical field.", "My electronic invention would be a tiny robot", "that kills cancer.", "Vanessa:Oh, okay.", "Dan:A cancer killing search and destroy robot.", "Vanessa:Wow. That's noble.", "Dan:I think they might be working on this.", "Vanessa:Yeah. I don't know much about that field.", "Dan:I think there is some kind of tiny robot,", "for lack of a better word,", "that can find certain diseases or cells in the body.", "You know, I do not have a background in biotech at all,", "but I would almost guarantee somebody's trying to figure out", "how to get tiny robots that can find and kill cancer in people.", "Vanessa:That sounds great.", "Dan:That would be probably the best use", "of an electronic gadget.", "Vanessa:Mine is very selfish compared to that.", "Dan:Yeah, because nothing sucks more than cancer,", "I think. This is just the worst thing.", "Vanessa:Yeah. Well, if you are in biotech", "or if you are a cancer related doctor or surgeon", "Dan:Send me your number and I'll tell you my plans.", "Vanessa:Yeah. Let us know.", "Does something like this exist?", "Is this something that's in the works?", "Yeah. Never know.", "Dan:Yeah. How about you?", "How many cancer destroying things", "are you creating in your spare time?", "Vanessa:Oh, sorry. Mine's very selfish.", "I was thinking more personal.", "In our house, to go to our deck,", "we have a sliding door.", "There's a glass sliding door,", "and then there's a screen that you can just push through.", "It's a magnet, you can just go through it.", "But in the summer, we try to keep", "the glass sliding door closed", "because there's air conditioning in our house", "and it's super hot and muggy, humid outside,", "so we don't want that air to get inside.", "We want it to stay cool inside.", "We go in and out a lot in our house.", "With young children, it's kind of tricky", "to get them to keep that glass door closed.", "It's also kind of heavy.", "Dan:The sliding door.", "Vanessa:Yeah, for them to pull it open is okay,", "and then they bust through the screen door", "and they're outside like, I'm going to go do something,", "and they don't think about the glass door.", "And for me too, sometimes if I'm carrying something,", "I have to open the door.", "My electronic gadget would be a button", "that you can push that would open the door,", "and then automatically within 30 seconds,", "it would close the door,", "so you have time to go through and it would close.", "It might be sensor by your body,", "so if you're still in the doorway it wouldn't close,", "but that way it would always close behind us.", "Dan:Couldn't you just use in the grocery store", "where it automatically opens?", "Vanessa:Yeah, something like that.", "Dan:A sliding automatic door.", "Vanessa:But people don't have that in their house.", "Dan:Oh. But it's only a matter of money.", "Vanessa:I mean, maybe we could get something like that", "installed in our house now,", "but I was kind of envisioning,", "I imagine people who are handicapped or in a wheelchair,", "maybe they have something like this that's automatic.", "Dan:Probably.", "Vanessa:I'm sure it's a big system you have to install.", "It's probably a lot of money or kind of a hassle,", "but I'm sure there's some kind of system.", "Dan:Well, we could go to a closed down grocery store,", "and every time it opens, it says, Welcome to Aldi.", "Vanessa:As in we would take Aldi's doors?", "Dan:Yeah.", "Vanessa:And put them in our house,", "and it would have a speaker that says,", "Welcome to the grocery store,", "every time we open our house's doors?", "Dan:It'd be the most charming thing we could possibly add to our home.", "Vanessa:Maybe we could have it say, Welcome home, Vanessa.", "Dan:Oh, yeah. Programmable.", "Vanessa:I don't think I would like my doors to talk.", "Dan:And it also takes off your hat.", "Vanessa:Wow.", "Dan:With an arm.", "Vanessa:Maybe it also feeds you food and gives you water.", "Dan:And it's a conveyor belt too,", "so you don't have to walk through it.", "Vanessa:And maybe it is also your brain,", "so you don't have to think.", "Dan:And there's another arm that puts a soda in your hand.", "Vanessa:That's weird.", "Yes. I would like our glass sliding door", "to be closed more easily", "so that it is not a personal hassle", "or an annoyance in our home.", "But I must say that Dan's cancer fighting robots", "are probably a better idea.", "Anyway, I thought about this question for about 4.2 seconds.", "Dan:And I thought of it for four minutes.", "Vanessa:Okay.", "Dan:To be fair.", "Vanessa:Yeah.", "So, maybe if I thought about it for four minutes", "I would've come up with a better idea.", "Anyway, what about you?", "What kind of new electronic gadget would you like to invent,", "and what would it do?", "Let us know in the comments", "and we'll go to our next question.", "Question number 11 is about money.", "I'd like to know what is something", "that you can justify spending more money on and why?", "Dan:Yeah. Justify.", "I mean, probably speakers.", "Vanessa:We always talk about speakers.", "Dan:I'm kidding.", "I like audio stuff a lot.", "I would say maybe once a year", "I just start looking into some audio equipment", "or some kind of electronics, usually.", "I'm like, Vanessa, do you think we could?", "She's like, No, we have 10 speakers,", "or headphones or something.", "You know?", "Vanessa:We talked about this in past videos.", "Dan:Yes. This is not actually my answer.", "I said property."]