["sick or not.", "Dan: You got to milk them.", "Vanessa: Christmas or Thanksgiving, any day, twice a day,", "they have to go to the barn and milk that cow.", "Dan: Yeah. And it's just two people there.", "Vanessa: Yeah. They didn't hire anyone to help them,", "so they never get a vacation,", "which they could hire someone to help occasionally.", "Dan: I will just say", "Vanessa: Anyway. Not my style.", "Dan: I saw a twinge of regret in her eyes", "when she was talking about this decision.", "Vanessa: Yeah. They loved those cows", "and they took good care of them.", "But they're like, Oh, this is relentless.", "Dan: Yeah. Because in their previous life,", "they weren't Well life.", "Jobs or careers, they weren't farmers at all.", "Vanessa: Yeah.", "Dan: They made a conscious decision to go back to farming.", "Vanessa: Yeah. Anyway, that's my answer, a cow.", "Dan: That could be you.", "Vanessa: That could be me. We'll see.", "Anyway, what about you?", "What pet, if you could have any pet in the world,", "or any animal really, it doesn't even have to be a pet,", "what would you have? Let us know in the comments.", "And we'll go to our final question. Are you ready?", "Dan: Ready.", "Vanessa: Let's go. The final question.", "Question number 15. We've made it this far", "is about books. Something that's a love of my life.", "The question is", "Dan: And not as much mine.", "Vanessa: Yeah, so I'm very curious", "what you have to say about this.", "What is a book that you would recommend everyone read", "because you loved it so much?", "Dan: Yeah. My answer's definitely a cop out here.", "Vanessa: Yeah.", "Dan: Because I don't read that much.", "And the most I ever read, we had a book club", "and it basically required me to read.", "And I like reading a lot. I just don't do it.", "I find myself listening to something or watching something first.", "So my cop out answer is some parenting book.", "Vanessa: Oh, okay.", "Dan: So the one that comes to my mind", "is called Peaceful Parenting,", "but I don't think it specifically has to be that.", "It just has to be something that is not too modern,", "but not just handed down generationally,", "like, I just do what my parents did.", "Something intentional, training people basically", "how to be better, kinder, gentler parents for their children.", "How to talk to them better.", "There's a lot of strategies and tips you can get", "for talking about or talking to children.", "And the book also needs to have like a lot of", "what's that child psychology informing it scientifically", "because the more you learn about children,", "the more you learn that they are developing at different times", "and rates and you might think they can handle something,", "but in reality, their brains literally can't handle it.", "So that gives you more patience.", "Vanessa: Yeah.", "Dan: Because there's a lot of people,", "a lot of parents who just think their kids are stubborn", "or just want to yell at them for things,", "but they don't really get the full picture", "about the child's development and their needs.", "Vanessa: Yeah. Yeah.", "Dan: So that's my answer even though it's not really one specific book.", "Vanessa: Don't worry.", "Dan: I have other books that I really enjoyed,", "but maybe aren't as relevant to people.", "One that came to my mind is called Educated.", "Vanessa: Oh, that was an interesting book.", "Yeah.", "Dan: But that feels really relevant to me", "because I was homeschooled.", "And so this girl was homeschooled,", "but in a really bad environment.", "And so it's that story basically of being extremely sheltered.", "And basically even in that terrible environment,", "there's almost pros and cons to it.", "It almost made her stronger in some ways,", "even though it was awful.", "Vanessa: That's an interesting story.", "Dan: That was a very interesting book to me.", "Vanessa: Yeah. I would say for the parenting books,", "I have an Amazon link.", "Dan: She's got a list for you.", "Vanessa: I do. It's a Speak English With Vanessa Amazon book storefront.", "So I've chosen a bunch of books that I recommend", "because I've made a lot of videos about books on this channel.", "So in the description of this video,", "you can see the Amazon link for my book recommendations", "and there's different folders.", "There's children's books, there's beginner English books.", "If you've never read a book in English before,", "this is what I recommend reading.", "There's intermediate books, there's nonfiction books.", "Vanessa: And in that children's book section", "are books for children,", "but also parenting book recommendations", "that have really impacted us and have been useful in our lives.", "For example, a book called Hunt, Gather, Parent.", "There's another book called Peaceful Parent, Happy Kids.", "And if you have more than one child,", "Peaceful Parent, Happy Siblings is amazing.", "We've read a lot of these styles of books.", "And I think it's just changing your mindset", "about how to respect your child,", "but also still be the authority.", "Dan: Yeah.", "Vanessa: Anyway, like Dan said", "Dan: It's a tough balance.", "Vanessa: some psychology as well.", "So there's a lot of recommendations.", "If you click on that Amazon link", "and you would like to dive into the world", "of a better relationship with your child,", "Dan: Especially if you got kids out there.", "Vanessa: Oh yeah.", "Or you are interacting with children.", "Anyway, it's very insightful.", "My recommendation was also on a similar nonfiction route.", "Because I've read a lot of fiction that's personally made me feel passionate", "about different topics.", "And I love reading fiction and diving into different worlds,", "especially historical fiction where you're learning about something in history.", "But I would say the book that made me"]