["that was really great.", "Dan: This is all blasphemy to me.", "Vanessa: Because you always had a real tree.", "Dan: It had to be real.", "Vanessa: And then we...", "Dan: If there's not a fire hazard in your living room,", "it's not Christmas.", "Vanessa: Yeah, that's a big reason why we had a fake tree", "is because when my dad was a kid,", "they had a real tree.", "Dan: Oh, yeah.", "Vanessa: Maybe for one Christmas,", "I don't remember if it was for longer than that.", "And they had a train set going around it", "so they could turn on the electric train", "and it would go around the bottom of the Christmas tree,", "not in the branches, but just on the ground,", "and it caught fire.", "Dan: Oh.", "Vanessa: And my dad said one of his first memories", "is him as a little kid,", "getting a cup of water and throwing it on the Christmas tree fire.", "This is huge hazard.", "And there's so many warnings.", "Dan: I mean, I don't think so much anymore.", "Vanessa: Yeah, this is a big deal.", "Dan: Christmas trees are safe.", "Vanessa: Christmas trees are not safe,", "because they say now,", "I think it's more known now that you should always keep water,", "so you have the Christmas tree that's cut", "and you put it in a little basin of water,", "and if there's not water in there,", "the tree will dry out and it will catch fire really easily.", "But, if it's filled with water,", "then the tree is hydrated and it won't catch fire as easily.", "Dan: But also, 60s electronics,", "versus...", "Vanessa: Okay. That's true.", "Dan: Today's electronics.", "They're not going to catch fire the same way.", "Vanessa: Yeah.", "Dan: Probably.", "Vanessa: Yeah.", "Dan: Christmas trees are safe and the best.", "Vanessa: Dan loves Christmas trees.", "So, I remember, yeah,", "we would do that,", "and then we would decorate the tree.", "And my mom always had one ornament,", "which I now have", "that was the first ornament we put on the tree.", "Dan: Which one was that?", "Vanessa: It's the ball that has lots of little beads on it.", "And it's got...", "Dan: Ball with beads.", "Vanessa: Ribbons, and knots, and stuff on it.", "We have it.", "Dan: Well, I love Christmas trees", "and I can't remember this ornament.", "Vanessa: Oh, well it's in our house.", "Dan: That's good.", "It'll be refreshing this year to see it later.", "Vanessa: And, she put that on the tree", "and that signified,", "we can start to decorate the tree.", "So yeah, we would decorate the tree together", "and it was just a nice time to do that.", "Dan: How did you guys sit back", "and not decorate the tree right away?", "Our children are like,", "Bah, get all the stuff.", "Put it on right away.", "Vanessa: Yeah, we did the ornaments.", "We were busy doing the branches.", "Dan: Maybe because it's two girls versus two boys.", "Vanessa: I don't know.", "But, we did it and it was fun.", "And I remember when we got married,", "that was my first real Christmas tree.", "We went to a place and got a real tree", "and Dan: That was your first?", "Vanessa: Yeah.", "Dan: Oh, we got the little one.", "Vanessa: We got a little tree.", "Yeah.", "Dan: That we planted later.", "Vanessa: Oh, yeah.", "Dan: That's another thing you can do sometimes in America,", "but it's more difficult.", "Vanessa: Yeah, you can get it with the root ball on the bottom.", "The first year we were married", "Dan: It's a lot heavier.", "Vanessa: Oh my goodness, it was so heavy.", "I remember it took three of us.", "Dan: It was three feet tall.", "Vanessa: Me, you, and your brother", "to take it out of the car and drag it into our house.", "Dan: Mm hmm affirmative.", "Vanessa: Because it was so big,", "but we wanted to plant it later,", "we didn't want to just cut a tree down.", "So, we got this tree with a root ball,", "but ever since then,", "we've just gotten a cut tree,", "and put it in our house,", "and decorated it.", "And yeah, it's a lot of fun.", "Dan: Always a happy time.", "Vanessa: Yeah.", "Well, I want to know for you,", "what is your favorite holiday tradition?", "It might not be about Christmas.", "It could be about any holiday.", "But, I want to know about your experience.", "Let us know in the comments,", "what's your favorite holiday tradition?", "And we'll go on to our next question.", "Question number nine is about sports and exercise.", "What is the most recent sport that you did?", "Dan: Well, this happened just about a week ago actually.", "And it's the first time I ever did this outdoors.", "It was rock climbing.", "Is this a sport?", "I guess, it's a sport.", "Vanessa: It's considered exercise.", "Dan: Yeah.", "And so, my brother in law is,", "let's just say, obsessed with rock climbing.", "And, he's gotten pretty good at it lately.", "And so, he met us in between where he lives and us.", "We live about eight hours away.", "And, we were in West Virginia,", "which has actually a lot of good rock climbing.", "And we chose a spot and he had all the gear,", "he's got the ropes, he's got the shoes,", "he's got the backpacks, he's got the harness,", "and all this stuff.", "And he actually...", "Oh the helmet too.", "Don't forget the helmet.", "And, he geared me up to do it.", "And, I was actually pretty nervous about it,"]